; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v8)
             (pred_3 ?v9 ?v11)
             (pred_11 ?v1 ?v11)
             (pred_7 ?v2 ?v1 )
	     (pred_12 ?v1)
             (pred_5 ?v7)
             (pred_8 ?v9)
             (pred_9 ?v11)
             (pred_6 ?v1)
             (pred_10 ?v9)
             (pred_4 ?v1)
             (pred_1 ))



(:action op_4
:parameters (?v12 ?v6 ?v5 ?v13)
:precondition (and (pred_5 ?v12) (pred_5 ?v6) (pred_8 ?v5) (pred_9 ?v13)
          (pred_2 ?v12 ?v6) (pred_3 ?v5 ?v13)
                   (pred_11 ?v6 ?v13) (pred_12 ?v12) 
                   (pred_6 ?v6) (pred_10 ?v5))
:effect (and  (pred_4 ?v6) (not (pred_6 ?v6))))


(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_5 ?v12) (pred_5 ?v10)
               (pred_12 ?v12) (pred_2 ?v12 ?v10) (pred_4 ?v10))
:effect (and (pred_12 ?v10) (not (pred_12 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_8 ?v5) 
                  (pred_12 ?v12) (pred_7 ?v5 ?v12) (pred_1 ))
:effect (and (pred_10 ?v5)
   (not (pred_7 ?v5 ?v12)) (not (pred_1 ))))


(:action op_3
:parameters (?v12 ?v4 ?v3)
:precondition (and (pred_5 ?v12) (pred_8 ?v4) (pred_8 ?v3)
                  (pred_12 ?v12) (pred_10 ?v3) (pred_7 ?v4 ?v12))
:effect (and (pred_10 ?v4) (pred_7 ?v3 ?v12)
        (not (pred_10 ?v3)) (not (pred_7 ?v4 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_8 ?v5) 
                  (pred_12 ?v12) (pred_10 ?v5))
:effect (and (pred_1 ) (pred_7 ?v5 ?v12) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_22 obj_13 obj_14 obj_05 obj_17 obj_10 obj_02 obj_18 obj_03 obj_20 obj_21 obj_01 obj_16 obj_19 obj_06
    obj_12 obj_09 obj_15
    obj_08 obj_07 obj_04
    )

    (:init
       (pred_1)

       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_05)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_18)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_15)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_04)

       (pred_2 obj_11 obj_05)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_22)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_10 obj_20)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_10)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_21 obj_06)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_06 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_11  obj_17 obj_12)
       (pred_11  obj_20 obj_09)
       (pred_11  obj_19 obj_15)
       (pred_4 obj_11)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_21)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_06)

       (pred_3  obj_08 obj_12)
       (pred_3  obj_07 obj_09)
       (pred_3  obj_04 obj_15)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_04 obj_18)
       (pred_12 obj_21)
    )

    (:goal (and
       (pred_7 obj_08 obj_21)
       (pred_7 obj_04 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_03)))
)
)

; plan
1. (op_2 obj_21 obj_02)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_02)
   goals met: 0 of 2
2. (op_2 obj_02 obj_14)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_14)
   goals met: 0 of 2
3. (op_2 obj_14 obj_13)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_13)
   goals met: 0 of 2
4. (op_2 obj_13 obj_22)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_22)
   goals met: 0 of 2
5. (op_2 obj_22 obj_11)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_11)
   goals met: 0 of 2
6. (op_2 obj_11 obj_05)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_05)
   goals met: 0 of 2
7. (op_2 obj_05 obj_18)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_18)
   goals met: 0 of 2
8. (op_5 obj_18 obj_04)
   deleted: (pred_7 obj_04 obj_18) (pred_1)
   added: (pred_10 obj_04)
   goals met: 0 of 2
9. (op_2 obj_18 obj_05)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_05)
   goals met: 0 of 2
10. (op_2 obj_05 obj_11)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_11)
   goals met: 0 of 2
11. (op_2 obj_11 obj_22)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_22)
   goals met: 0 of 2
12. (op_2 obj_22 obj_13)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_13)
   goals met: 0 of 2
13. (op_2 obj_13 obj_14)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_14)
   goals met: 0 of 2
14. (op_2 obj_14 obj_02)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_02)
   goals met: 0 of 2
15. (op_2 obj_02 obj_21)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_21)
   goals met: 0 of 2
16. (op_2 obj_21 obj_06)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_06)
   goals met: 0 of 2
17. (op_4 obj_06 obj_19 obj_04 obj_15)
   deleted: (pred_6 obj_19)
   added: (pred_4 obj_19)
   goals met: 0 of 2
18. (op_2 obj_06 obj_21)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_21)
   goals met: 0 of 2
19. (op_1 obj_21 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_1) (pred_7 obj_04 obj_21)
   goals met: 0 of 2
20. (op_2 obj_21 obj_06)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_06)
   goals met: 0 of 2
21. (op_2 obj_06 obj_19)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_19)
   goals met: 0 of 2
22. (op_2 obj_19 obj_16)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_16)
   goals met: 0 of 2
23. (op_5 obj_16 obj_08)
   deleted: (pred_7 obj_08 obj_16) (pred_1)
   added: (pred_10 obj_08)
   goals met: 0 of 2
24. (op_2 obj_16 obj_19)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_19)
   goals met: 0 of 2
25. (op_2 obj_19 obj_06)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_06)
   goals met: 0 of 2
26. (op_2 obj_06 obj_21)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_21)
   goals met: 0 of 2
27. (op_3 obj_21 obj_04 obj_08)
   deleted: (pred_10 obj_08) (pred_7 obj_04 obj_21)
   added: (pred_10 obj_04) (pred_7 obj_08 obj_21)
   goals met: 1 of 2
28. (op_2 obj_21 obj_02)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_02)
   goals met: 1 of 2
29. (op_2 obj_02 obj_14)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_14)
   goals met: 1 of 2
30. (op_2 obj_14 obj_13)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_13)
   goals met: 1 of 2
31. (op_1 obj_13 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_1) (pred_7 obj_04 obj_13)
   goals met: 2 of 2
